#ifndef _SKATINGMODULES_H_
#define _SKATINGMODULES_H_
//------------------------------------------------
#include "setting.h"

//------------------------------------------------
//  マクロ定義(Macro definition)
//------------------------------------------------

//------------------------------------------------
//  型定義(Type definition)
//------------------------------------------------


//------------------------------------------------
//  プロトタイプ宣言(Prototype declaration)
//------------------------------------------------
void majority(int [][JUDGE_NUMBER + 1]);
void SumSuperior(int [][JUDGE_NUMBER + 1]);
void SumSubordinate(int [][JUDGE_NUMBER + 1]);

//------------------------------------------------

#endif